#+title: persemacs-dev
#+author: Erwann Rogard
#+property: header-args :tangle no
#+property: header-args :emacs-lisp :lexical-binding t

#+name: doc-lead
#+begin_src org
  This is a standalone Emacs Org file containing emacs-lisp development with a focus on noweb-ref
#+end_src

***** adapt-keyword

#+name: fn-keyword-adapt
#+header: :noweb-ref el-meta-adapt
#+begin_src emacs-lisp
  (cl-defmacro er317/adapt-keyword
      (&key
       source-symb
       (lambda-fn (symbol-function source-symb))
       target-key-list
       result-key-list
       target-symb
       (result-call-type :funcall)
       &allow-other-keys
       &aux
       ;; --- Resolution Flags ---
       (__target-symb target-symb)
       
       (__result-wrap-flag
        (cond
         ((and target-key-list result-key-list) :wrap)
         ((and target-key-list (not result-key-list)) :wrap)
         ((not target-key-list) :identity)
         (t (error "Invalid combination of :target-key-list and :result-key-list"))))

       ;; --- Derived Internal Variables ---       
       (__target-symb-list (when target-key-list (cl-loop for k in target-key-list collect (intern (substring (symbol-name k) 1)))))
       
       (__result-fn
        (cond
         ((eq __result-wrap-flag :wrap) (lambda (result-list) (er317/zip-to-plist :key-list result-key-list :value-list result-list)))
         ((eq __result-wrap-flag :identity) #'identity)))

       (__source-name (if source-symb (source-name source-symb) "LAMBDA"))
       
       )
    "Define TARGET-FN as a keyword-based wrapper around SOURCE-FN. Optionally transforms the result using RESULT-KEY-LIST and TARGET-KEY-LIST. Optional argument RESULT-CALL-TYPE controls whether the result function is called via funcall (default) or apply.

  Example:
    (er317/adapt-keyword
   :lambda-fn (lambda (x) (list (* x x)))
   :target-symb my-square-fn
   :target-key-list (:x)
   :result-key-list (:square))"
    `(cl-defun ,__target-symb
         (&key ,@__target-symb-list
  	     &aux (__result-raw (apply ,lambda-fn (list ,@__target-symb-list)))
  	     (result
  	      (pcase
  	  	  ',result-call-type (:funcall (funcall ,__result-fn __result-raw))
  	    	  (:apply (apply ,__result-fn __result-raw))
  	    	  (_ (error "Invalid :result-call-type %s, expected :funcall or :apply" ',result-call-type)))))
       ,(format "Refactored wrapper around %s, accepting keyword args %s." __source-name target-key-list)
       result))
#+end_src

#+RESULTS: fn-keyword-adapt
: er317/adapt-keyword

#+begin_src emacs-lisp
  (er317/adapt-keyword
   :lambda-fn (lambda (x) (list (* x x)))
   :target-symb my-square-fn
   :target-key-list (:x)
   :result-key-list (:square))
#+end_src

#+RESULTS:
: my-square-fn

#+begin_src emacs-lisp
  (my-square-fn :x 2)
#+end_src

#+RESULTS:
| :square | 4 |

***** capture

#+name: el-capture-warnings
#+header: :noweb-ref el-meta-capture
#+begin_src emacs-lisp
  (cl-defmacro er317/capture-warnings (&key el-list)
    "Returns calls to `display-warning` while evaluating EL-LIST.

  Example:
    ```
  (er317/capture-warnings
   :el-list
   ((display-warning 'my-test "This is a test warning.")))
  ```"
    ;;    (unless (listp el-list)
    ;;    (error (format "%S is not a list" el-list)))
    `(let ((captured-warnings '()))
       (cl-letf (((symbol-function 'display-warning)
                  (lambda (type message &optional level buffer-name)
                    (push (list type message level buffer-name) captured-warnings))))
         ,@el-list
         captured-warnings)))
#+end_src

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/capture-warnings
   :el-list
   ((display-warning 'my-test "This is a test warning.")))
#+end_src

#+RESULTS:
| my-test | This is a test warning. | nil | nil |

***** plist-merge

#+header: :noweb-ref el-backend
#+begin_src emacs-lisp
  (cl-defun er317/plist-merge (&key source target)
    "Merge SOURCE and TARGET property lists, with SOURCE taking precedence."
    (let* ((keys
            (cl-loop for (k _) on source by #'cddr collect k))
           (filtered
            (cl-loop for (k v) on target by #'cddr
                     unless (memq k keys)
                     append (list k v))))
      (append source filtered)))
#+end_src

#+RESULTS:
: er317/plist-merge

#+header: :noweb-ref el-check
#+begin_src emacs-lisp
  (er317/plist-merge
      :source '(:foo 1 :bar 2)
      :target '(:bar 99 :baz 42))
#+end_src

#+RESULTS:
| :foo | 1 | :bar | 2 | :baz | 42 |

***** plist-put

#+header: :noweb-ref el-backend
#+begin_src emacs-lisp
  (cl-defun er317/plist-put
      (&key target-plist source-plist &allow-other-keys)
    "Generalized `plist-put` function.

  Compute:
  - TARGET-LIST <- Override or extend TARGET-PLIST with SOURCE-PLIST.

  Return:
  TARGET-LIST."
    (if source-plist
        (cl-destructuring-bind (k v &rest rest) source-plist
     	(er317/plist-put
     	 :target-plist (plist-put target-plist k v)
     	 :source-plist rest))
      target-plist))
#+end_src

#+RESULTS:
: er317/plist-put

#+header: :noweb-ref el-check
#+header: :results raw
#+begin_src emacs-lisp
  (er317/plist-put
   :target-plist '(:same-p 'eq)
   :source-plist '(:same-p 'equal :key 'foo))
#+end_src

#+RESULTS:
(:same-p 'equal :key 'foo)

***** plist-to-alist

#+header: :noweb-ref el-module-list
#+begin_src emacs-lisp
  (cl-defun er317/plist-to-alist (&key plist unkeyword &allow-other-keys)
    "Convert PLIST to an alist.
      
    Example:
    ```
    (er317/plist-to-alist
        :plist '(:foo \"x\" :bar \"y\")
        :unkeyword t)
    ```"
    (cl-loop for (k v) on plist by #'cddr
             collect (cons (if (and unkeyword (keywordp k))
                               (intern (substring (symbol-name k) 1))
                             k)
                           v)))
#+end_src

#+RESULTS:
: er317/plist-to-alist

#+header: :noweb-ref el-example
#+header: :var plist='(:foo "x" :bar "y")
#+begin_src emacs-lisp
  (er317/plist-to-alist :plist plist :unkeyword t)
#+end_src

#+RESULTS:
: ((foo . x) (bar . y))

***** alist-to-plist

#+header: :noweb-ref el-module-list
#+begin_src emacs-lisp
  ;; Convert alist to plist
  (cl-defun er317/alist-to-plist (&key alist keywordize &allow-other-keys)
    "Convert ALIST to a plist.

    Example
    ```
      (er317/alist-to-plist
    :alist '((foo . "x") (bar . "y"))
    :keywordize t)
    ```"
    (cl-loop for (k . v) in alist
             append (list (if (and keywordize (symbolp k) (not (keywordp k)))
                              (intern (concat ":" (symbol-name k)))
                            k)
    			v)))
#+end_src

#+RESULTS:
: er317/alist-to-plist

#+header: :noweb-ref el-example
#+header: :var alist='((foo . "x") (bar . "y"))
#+begin_src emacs-lisp
  (er317/alist-to-plist :alist alist :keywordize t)
#+end_src

#+RESULTS:
| :foo | x | :bar | y |

***** zip-to-plist

#+header: :noweb-ref el-module-list
#+begin_src emacs-lisp
  (cl-defun er317/zip-to-plist
      (&key key-list value-list
  	  &allow-other-keys
  	  &aux
  	  (__key-len (if (listp key-list) (length key-list)
  		       (error "key-list is not a list: %S" key-list)
                         ))
  	  (__value-len (if (listp value-list) (length value-list)
  			 (error "value-list is not a list: %S" value-list)
  			 ))
  	  (__length-check (unless (= __key-len __value-len)
  			    (error "Length mismatch: keys (%d) vs values (%d)"
  				   __key-len __value-len)))
  	  )
    (apply #'append
  	 (cl-mapcar (lambda (k v)
                        (unless (keywordp k)
  			(error "Expected keyword: %S" k))
                        (list k v))
                      key-list value-list)))
#+end_src

#+RESULTS:
: er317/zip-to-plist

#+header: :noweb-ref el-ref-example
#+header: :var key-list='(:foo :bar)
#+header: :var value-list='("x" "y")
#+begin_src emacs-lisp
  (er317/zip-to-plist
   :key-list '(:foo :bar)
   :value-list '("x" "y"))
#+end_src

#+RESULTS:
| :foo | x | :bar | y |

***** plist-transpose

#+header: :noweb-ref el-module-list
#+begin_src emacs-lisp
  (cl-defun er317/plist-transpose (&key plist)
    "Transpose a PLIST of keys and list-values into a list of row-wise plists.

  Example:
  ```
  (er317/plist-transpose
      :plist '(:key1 (v1 v2) :key2 (w1 w2)))
  ```"
    (let* ((keys (cl-loop for (k _) on plist by #'cddr collect k))
           (columns (cl-loop for (_ v) on plist by #'cddr collect v))
           (rows (apply #'cl-mapcar #'list columns)))
      (mapcar (lambda (vals)
                (cl-loop for k in keys
                         for v in vals
                         nconc (list k v)))
              rows)))
#+end_src

#+RESULTS:
: er317/plist-transpose

#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (let ((input '(:key1 (1 2 3)
  		     :key2 ("a" "b" "c"))))
    (er317/plist-transpose :plist input))
#+end_src

#+RESULTS:
| :key1 | 1 | :key2 | a |
| :key1 | 2 | :key2 | b |
| :key1 | 3 | :key2 | c |

***** list-map-append

#+header: :noweb-ref el-module-list 
#+begin_src emacs-lisp
  (cl-defun er317/list-map-append
      (&key before-list after-list (middle-list-seq (error "*-seq is nil")) &allow-other-keys)
    "Append BEFORE-LIST and AFTER-LIST to each LIST in MIDDLE-LIST-SEQ

  Example:
  ```
  (er317/list-map-append 
     :middle-list-seq '((:b 2) (:b 3))
     :before-list '(:a 1)
     :after-list '(:c 4))
  ```"
    (cl-loop for list in middle-list-seq
             collect (append before-list list after-list)))
#+end_src

#+RESULTS:
: er317/list-map-append

#+header: :noweb-ref el-ref-example
#+header: :results raw replace
#+begin_src emacs-lisp
  (er317/list-map-append 
   :middle-list-seq '((:b 2) (:b 3))
   :before-list '(:a 1)
   :after-list '(:c 4))
#+end_src

#+RESULTS:
((:a 1 :b 2 :c 4) (:a 1 :b 3 :c 4))
((:a 1 :b 2 :c 4) (:a 1 :b 3 :c 4))
nil

****** filter

#+header: :noweb-ref el-ref-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-filter
      (&key
       ref-list
       (head-re "^")
       middle-re
       (tail-re "$")
       regex
       buffer
       element-parse-option-list
       (babel-info-arglist '(:no-eval t))
       each-babel-info-key
       each-func
       each-arglist
       &aux
       (__arglist (let ((symb-list '(ref-list head-re middle-re tail-re regex buffer element-parse-option-list babel-info-arglist each-babel-info-key each-func each-arglist))) (er317/symb-list-to-plist :symb-list symb-list)))
       (__regex-flag
        (cond
         ((and regex (or middle-re ref-list))
          (error "Inconsistent input: `regex` and either of `middle-re` and `ref-list`"))
         ((and middle-re ref-list)
          (error "Inconsistent input: both `middle-re` and `ref-list`"))
         (regex :regex)
         (middle-re :middle-re)
         (ref-list :ref-list)
         (t (error "neither of `regex`, `middle-re`, or `ref-list` are provided"))))

       (__middle-re
        (cond
         ((eq __regex-flag :middle-re) middle-re)
         ((eq __regex-flag :ref-list)
        	(format "\\(%s\\)" (string-join ref-list "\\|")))))

       (__regex
        (cond
         ((eq __regex-flag :regex) regex)
         ((memq __regex-flag '(:middle-re :ref-list))
        	(concat head-re __middle-re tail-re))))

       (__each-func-flag
        (cond
         ((and each-func each-babel-info-key)
    	(error "Both :each-func and :each-babel-info-key are provided"))
         (each-func :each-func)
         (each-babel-info-key :each-babel-info-key)
         (t :identity)))

       (__each-func
        (cond
         ((eq __each-func-flag :each-func) each-func)
         ((eq __each-func-flag :each-babel-info-key)
    	(lambda (info-plist) (plist-get info-plist each-babel-info-key)))
         (t #'identity)))
       &allow-other-keys)
    "Filters source block info by matching noweb-ref on REGEX.

       Execution flow:
       - RESULT <- '()
       - For each SOURCE-BLOCK in BUFFER
           - INFO-PLIST <- BABEL-INFO to plist
           - When :noweb-ref matches REGEX
              - VALUE <- (EACH-FUNC INFO-PLIST EACH-ARGLIST)
              - RESULT <- (append RESULT (list VALUE))
       - RESULT

       Example:
       ```
       (er317/noweb-ref-filter
        :regex \"^\\(foo\\|bar\\)$\"
        :each-babel-info-key :body)
       ```"
    (cond
     ((and buffer (not (eq buffer (current-buffer))))
      (with-current-buffer buffer
        (apply #'er317/noweb-ref-filter __arglist)))
     (t
      (let ((results '()))
        (org-element-map (apply #'org-element-parse-buffer element-parse-option-list) 'src-block
  	(lambda (elem)
            (let* ((begin (org-element-property :begin elem))
          	 (info-plist
                    (apply #'er317/babel-info-resolve babel-info-arglist)))
              (params (plist-get info-plist :header-args))
              (param-pair (assoc :noweb-ref params))
              (ref (when param-pair (cdr param-pair))))
            (progn
              (when (and param-pair (string-match-p __regex ref))
                (push (apply __each-func info-plist each-arglist) results))))))
      (nreverse results))))
#+end_src

#+RESULTS:
: er317/noweb-ref-filter

#+header: :noweb-ref el-ref-example
#+header: :results raw
#+header: :var regex="^sh-\\(cat\\|world\\|ahoy\\|eof\\)$"
#+begin_src emacs-lisp
  (er317/noweb-ref-filter :regex regex)
#+end_src

#+RESULTS:
((:lang sh :body cat << EOF  :header-args ((:results . replace) (:exports . code) (:noweb-ref . sh-cat) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) :switches  :name nil :start 38724 :coderef (ref:%s)) (:lang sh :body 'Ahoy, planet!' :header-args ((:results . replace) (:exports . code) (:noweb-ref . sh-ahoy) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) :switches  :name nil :start 38764 :coderef (ref:%s)) (:lang sh :body 'Hello, world!' :header-args ((:results . replace) (:exports . code) (:noweb-ref . sh-world) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) :switches  :name nil :start 38857 :coderef (ref:%s)) (:lang sh :body 'Hello, debugger!' :header-args ((:results . replace) (:exports . code) (:noweb-ref . sh-world) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) :switches  :name nil :start 38931 :coderef (ref:%s)) (:lang sh :body EOF :header-args ((:results . replace) (:exports . code) (:noweb-ref . sh-eof) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) :switches  :name nil :start 39006 :coderef (ref:%s)))

#+header: :noweb-ref el-ref-example
#+header: :results raw
#+header: :var regex="^sh-\\(cat\\|world\\|ahoy\\|eof\\)$"
#+begin_src emacs-lisp :wrap src sh
  (string-join
   (er317/noweb-ref-filter
    :regex regex
    :each-babel-info-key :body)
   "\n")
#+end_src

#+RESULTS:
#+begin_src sh
cat << EOF 
'Ahoy, planet!'
'Hello, world!'
'Hello, debugger!'
EOF
#+end_src

*** combo

#+header: :noweb-ref el-ref-symb-trash
#+begin_src emacs-lisp
  (cl-defun er317/symb-combo-next (&key (start-symb nil) (next-symb nil) (msg-type 'error) (key-p t))
    "Return a new interned symbol by appending NEXT-SYMB to START-SYMB using a separator."
    (condition-case err
        (cond
         ((null start-symb) start-symb)
         ((null next-symb) start-symb)
         ((not (symbolp next-symb))
          (error "NEXT-SYMB is not a symbol: %S" next-symb))
         ((and key-p (not (keywordp start-symb)))
          (error "START-SYMB is not a keyword: %S" start-symb))
         (t
          (let* ((sep "-")
                 (string-list (mapcar #'symbol-name (list start-symb next-symb)))
                 (symb-string (string-join string-list sep)))
            (intern (format "%s" symb-string)))))
      (error
       (er317/raise
        :type msg-type
        :message (error-message-string err)
        :arg-list (list :start-symb ,start-symb :next-symb ,next-symb))
       )))
#+end_src

#+RESULTS:
: er317/symb-combo-next


#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (er317/symb-combo-next :start-symb ':foo :next-symb 'bar)
#+end_src

#+RESULTS:
: :foo-bar

#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
(mapcar (lambda (args)
          (apply #'er317/symb-combo-next args))
        (list nil
          (list :start-symb :foo)
          (list :start-symb :foo :next-symb 'bar)))
#+end_src

#+RESULTS:
| nil | :foo | :foo-bar |

#+header: :noweb-ref el-ref-symb
#+begin_src emacs-lisp
  (cl-defun er317/symb-combo-list (&key (start-symb nil) (symb-list '()) (msg-type 'error) (key-p t))
    "Recursively builds a keyword by combining START-SYMB with each symbol in SYMB-LIST."
    (condition-case err
        (cond
         ((not (listp symb-list))
  	(error "SYMB-LIST is not a list: %S" symb-list))

         ((null symb-list)
  	(er317/symb-combo-next :start-symb start-symb :key-p key-p))
         (t
  	(let* ((next-symb (car symb-list))
                 (rest-symbs (cdr symb-list))
  	       ;; BUG:
                 (next-key (er317/symb-combo-next
  			  :start-symb start-symb
  			  :next-symb next-symb
  			  :msg-type msg-type))
  	       )
  	  (er317/symb-combo-list
  	   :start-symb next-key
  	   :symb-list rest-symbs
  	   :msg-type msg-type
  	   :key-p key-p))))
      (error
       (er317/raise
        :type msg-type
        :message (error-message-string err)))))
#+end_src

#+RESULTS:
: er317/symb-combo-list


#+begin_src emacs-lisp
  (er317/symb-combo-list :start-symb :foo :symb-list '(bar))
#+end_src

#+RESULTS:
: :foo-bar

#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (mapcar
   (lambda (args)
     (apply #'er317/symb-combo-list args))
   (list
    nil
    (list :start-symb :foo)
    (list :start-symb :foo :symb-list '(bar))
    (list :start-symb :foo :symb-list '(bar baz))))
#+end_src

#+RESULTS:
| nil | :foo | :foo-bar | :foo-bar-baz |

** compose

#+header: :noweb-ref el-ref-trash
#+begin_src emacs-lisp
  (defun er317/compose (arg &rest functions)
    "Apply a sequence of FUNCTIONS to ARG in composition order."
    (cl-reduce (lambda (acc fn) (funcall fn acc))
               (reverse functions)
               :initial-value arg))
#+end_src

#+RESULTS:
: er317/compose

#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (er317/compose 4 #'sqrt (lambda (x) (+ 1 x)))
#+end_src

#+RESULTS:
: 3.0

*** expand

#+header: :noweb-ref el-ref-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-expand (&key regex)
    "Expands all source blocks whose :noweb-ref matches REGEX and returns their expanded contents in a list."
    (let ((results '()))
      (org-element-map (org-element-parse-buffer) 'src-block
        (lambda (src)
          (let* ((begin (org-element-property :begin src))
                 (info (save-excursion
                         (goto-char begin)
                         (org-babel-get-src-block-info t)))
                 (params (nth 2 info))  ; header arguments parsed by org-babel
                 (ref (cdr (assoc :noweb-ref params))))
            ;; (message "DEBUG parsed params: %S" params)
            (when (and ref (string-match-p regex ref))
              (let ((expanded (org-babel-expand-noweb-references info)))
                (push expanded results))))))
      (nreverse results)))
#+end_src

#+RESULTS:
: er317/noweb-ref-expand

#+header: :noweb yes
#+header: :results verbatim
#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
   (er317/noweb-ref-expand :regex "sh-\\(hello\\|ahoy\\)")
#+end_src

#+RESULTS:
: ("'Hello, world!'" "'Hello, debugger!'" "'Ahoy, planet!'")

***** info

#+header: :noweb-ref el-ref-src-block-beta
#+begin_src emacs-lisp
  (defun er317/src-block-info (name &optional no-eval)
    "Gets info of block NAME"
    (let ((position (org-babel-find-named-block name)))
  	 (when block
  		 (save-excursion
                     (goto-char block)
                     (org-babel-get-src-block-info no-eval)))))
#+end_src

#+RESULTS:
: er317/src-block-info

#+header:  :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/src-block-info "json-foo")
#+end_src

#+RESULTS:
| json | { "key" : "X" } | ((:colname-names) (:rowname-names) (:result-params replace) (:result-type . value) (:results . replace) (:exports . code) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) |   | json-foo-bar | 1239 | (ref:%s) |

#+header: :noweb-ref el-ref-example
#+header: :results verbatim raw
#+begin_src emacs-lisp
  (er317/src-block-properties "bar-qux" :header)
#+end_src

#+RESULTS:
((":var value=\"qux\""))

#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (org-babel-parse-header-arguments
   (mapconcat (lambda (pair) (concat (car pair) " " (cadr pair)))
              (er317/src-block-properties "bar-qux" :header)
              " "))
#+end_src

#+RESULTS:
: ((:var . value="qux"))

***** example
#+header: :noweb-ref el-ref-example
#+begin_src emacs-lisp
  (er317/field-address 2)
#+end_src

#+RESULTS:
: @1$2..@>$2

***** example

#+header: :noweb-ref el-ref-example
#+header: :results value verbatim
#+begin_src emacs-lisp
(er317/table-range "tbl-foo-bar-string" (format "@1$%d..@>$%d" 2 2))
#+end_src

#+RESULTS:
: ("x" "y")

*** inline

#+header: :noweb-ref el-ref-inline-me
#+begin_src emacs-lisp
  (defmacro inline-me-square (x)
    "Square of X."
    `(* ,x ,x))
#+end_src

#+RESULTS:
: inline-me-square

#+header: :noweb-ref el-ref-example-body
#+begin_src emacs-lisp
  (+ (inline-me-square a)
     (inline-me-square b))
#+end_src

#+name: el-example-1
#+header: :noweb yes
#+begin_src emacs-lisp
    (defun example-compute-1 (a b)
      <<el-example-body>> )
#+end_src

#+RESULTS:
: example-compute

#+begin_src emacs-lisp
  (pp (symbol-function 'example-compute-1))
#+end_src

#+RESULTS:
: #[(a b) ((+ (inline-me-square a) (inline-me-square b))) nil]

#+name: el-example-2
#+header: :noweb yes
#+begin_src emacs-lisp
  (eval
   `(defun example-compute-2 (a b)
      ,(macroexpand-all
        '
        <<el-example-body>>)))
#+end_src

#+RESULTS: el-example-2
: example-compute-2

#+begin_src emacs-lisp
  (pp (symbol-function 'example-compute-2))
#+end_src

#+RESULTS:
: #[(a b) ((+ (* a a) (* b b))) nil]

#+header: :noweb-ref el-ref-example-defun
#+begin_src emacs-lisp
  `(defun example-compute (a b) ,el-seq)
#+end_src

#+header: :noweb yes
#+header: :var el-seq=
#+begin_src emacs-lisp
  <<el-example-defun>>
#+end_src
**** sh

#+begin_src sh
  json=$(
      cat <<'EOF'
  {
    "file":
    ["John\tDoe",
     "Jane\tSmith"]
  }
  EOF
      )

  # Iterate over each line in the array, splitting on tab
  echo "$json" | jq -r '.file[]' | while IFS=$'\t' read -r first last; do
      printf 'first=%s; last=%s\n' "$first" "$last"
  done

#+end_src

#+RESULTS:
| first=John; | last=Doe   |
| first=Jane; | last=Smith |

